<!-- dflook/terraform-github-actions {"workspace":"diff","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"690340acc507e12e6863062a6a85c756153d9a4204f94720e4edd286be9e28fc","plan_job_ref":"Job Test plan target and replace #377 at https://github.com/dflook/terraform-github-actions/actions/runs/7173497465","plan_hash":"4131a63a8d2e758c876ef9947b5b41dde713e5129de13895b0b9a44822c73f14","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __diff__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!       id          = "**********" -> (known after apply)
!       result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!       id          = "**********" -> (known after apply)
!       result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!   count   = "E51TRdWs7s" -> (known after apply)
!   foreach = "NAXlEaYawb" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #377](https://github.com/dflook/terraform-github-actions/actions/runs/7173497465)